X = [5, 9, 15, 19, 22, 28, 30, 33, 37, 40];
Y = [11, 12, 13, 16, 17, 17, 19, 19, 23, 25];
N = size(X, 2);
plot(X, Y, 'b--');
%--------------------------------------------
sum_x = 0; %сумма x
sum_x_2 = 0; %сумма x^2
sum_x_3 = 0; %сумма x^3
sum_x_4 = 0; %сумма х^4
sum_xy = 0; %сумма х * у
sum_x2y = 0; %сумма х^2 * y 
sum_y = 0; %сумма y
mid_x = 0; %x среднее
mid_y = 0; %y среднее
top_a = 0; %числитель коэффициента а
bottom_a = 0; %знаменатель коэффициента а
%--------------------------------------------
%Вычисления
for i = 1:N
    sum_x = sum_x + X(i);
    sum_x_2 = sum_x_2 + X(i) .^ 2;
    sum_x_3 = sum_x_3 + X(i) .^ 3;
    sum_x_4 = sum_x_4 + X(i) .^ 4;
    sum_x2y = sum_x2y + (X(i)).^2 .* Y(i);
    sum_xy = sum_xy + X(i) .* Y(i);
    mid_x = sum_x ./ N;
    sum_y = sum_y + Y(i);
    mid_y = sum_y ./ N;
end
%--------------------------------------------
for i = 1:N
   top_a = top_a + ((X(i) - mid_x) .* (Y(i) - mid_y));
   bottom_a = bottom_a + (X(i) - mid_x).^2;
end
%--------------------------------------------
a = top_a ./ bottom_a;
b = mid_y - a .* mid_x;
%--------------------------------------------
%Построение МНК для линейной функции
f = Y;
for i = 1:N
    f(i) = a .* X(i) + b;
end
hold on;
plot(X, f);
hold off;
%--------------------------------------------
%МНК для квадратической функции
matr = [N sum_x sum_x_2;
        sum_x sum_x_2 sum_x_3;
        sum_x_2 sum_x_3 sum_x_4;];
%--------------------------------------------
%Решение системы через обратную матрицу
sums = [sum_y; sum_xy; sum_x2y];
%--------------------------------------------
%Элементы матрицы - коэффициенты a b c
A = matr \ sums;
c1 = A(1);
b1 = A(2);
a1 = A(3);
%--------------------------------------------
%МНК для квадратической функции
F(8) = 1;
for i = 1:N
    F(i) = a1 .* (X(i))^2 + b1 .* X(i) + c1;
end
%--------------------------------------------
hold on;
plot(X, F);
grid on;
title('МНК');
legend('Первоначальная функция', '-0.372х + 8.3452', '0.0059x^2 + 0.1066x + 10.5982') 
hold off;